///* Батін Олексій Олександрович , ТМ — 62 , варіант №3
//Лабараторна робота №6. Проектування алгоритмів і програм циклічної структури 
//(оператор циклу з параметрами) */
#include <stdlib.h>
#include <stdio.h>
#include <math.h>
#include <string.h>
#include <Windows.h>
int main () {
  int i,m,k;
  float xn; // Обчислення значення
  SetConsoleOutputCP(1251);
  printf("Загальний член послідовності:\txn=ln(n+1)/5n^2+3\n\n"); // Вивід на екран
  printf("Вкажіть кількість членів послідовності (не менше 1) = ");
  scanf("%d",&m);
  if (m>=1) { // Перевірка членів послідовності
    printf("Вкажіть кількість колонок (від 1 до 6) = ");
    scanf("%d",&k);
    if (k >= 1 && k <= 6) { // Кількість колонок від 1 до 6 
      if(m<k) k=m; // Кількість членів послідовності менша кількості колонок 
      for(i=1;i<=k;i++)printf("———————————"); // Початок таблиці
      printf("——\n"); // Перехід на новий рядок для виведення значень
      for (i = 1; i <= m; i++) {
        xn = logf(i + 1.) / (5.*i*i + 3); // Обчислення Хн
        printf("| %8.5f ", xn);
        if (i%k==0) printf(" |\n"); // Перенос рядка
      }
      if (m%k) { // Закінчуємо таблицю 
        while (m%k)
        {
          printf("|          "); // Доповеннення рядків
          m++;
        }
        printf(" |\n");
      } // Закриваємо таблицю
      for(i=1;i<=k;i++)printf("———————————"); // Кінець таблиці
      printf("——\n"); 
      printf("\n");
    }
    else printf("Ви ввели значення поза проміжком [1;6]\n"); // Помилка колонок
  }
  else printf("Вы ввели значення менше 1\n\n"); // Помилка значення 
  system("pause");
}

